Structural Element may not be supported -- verify support for Element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StructuralElementMayNotBeSupported { get; }
  Visual Basic
Public Shared ReadOnly Property StructuralElementMayNotBeSupported As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StructuralElementMayNotBeSupported {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace